tp/exercise rails/group_01/app/controllers/schools_controller.rb

  def index
    @schools = School.all
    @students = Student.all
---
SELECT "students".* FROM "students"

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO "schools" ("school_name", "school_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["school_name", "mitov"], ["school_number", 120], ["created_at", "2018-03-13 08:23:21.281681"], ["updated_at", "2018-03-13 08:23:21.281681"]]