tp/exercise rails/group_01/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("first_name", "second_name", "email", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "rety"], ["second_name", "netzova"], ["email", "abv.bg"], ["school_id", 1], ["created_at", "2018-03-13 08:23:58.314915"], ["updated_at", "2018-03-13 08:23:58.314915"]]