tp/exercise rails/group_02/app/views/subjects/index.html.erb

        <td><%= subject.teacher.last_name %></td>
	<td><%= subject.teacher.first_name %></td>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]