tp/exercise rails/group_02/app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("subject_name", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subject_name", "bilogia"], ["teacher_id", 2], ["created_at", "2018-03-13 09:26:35.327434"], ["updated_at", "2018-03-13 09:26:35.327434"]]