tp/exercise rails/group_02/app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("first_name", "middle_name", "last_name", "title", "subject", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "r"], ["middle_name", "n"], ["last_name", "r"], ["title", "rrrr"], ["subject", "vvvv"], ["created_at", "2018-03-13 09:12:08.898847"], ["updated_at", "2018-03-13 09:12:08.898847"]]
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save