tp/exercise rails/group_03/app/controllers/computer_infos_controller.rb

SELECT "computer_infos".* FROM "computer_infos"
---
  def index
    @computer_infos = ComputerInfo.all

INSERT INTO "computer_infos" ("color", "brand", "processor", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["color", "red"], ["brand", "nvm"], ["processor", "nekav"], ["room_id", 1], ["created_at", "2018-03-13 10:30:06.290475"], ["updated_at", "2018-03-13 10:30:06.290475"]]
---
  def create
    @computer_info = ComputerInfo.new(computer_info_params)

    respond_to do |format|
      if @computer_info.save

SELECT  "computer_infos".* FROM "computer_infos" WHERE "computer_infos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_computer_info
      @computer_info = ComputerInfo.find(params[:id])