tp/exercise rails/group_03/app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("room_number", "room_size", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["room_number", 580], ["room_size", 1000], ["created_at", "2018-03-13 10:29:40.454933"], ["updated_at", "2018-03-13 10:29:40.454933"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save