tp/methods_rails/first_example/app/controllers/subscriptions_controller.rb

  def index
    @subscriptions = Subscription.all
---
SELECT "subscriptions".* FROM "subscriptions"

  def create
    @subscription = Subscription.new(subscription_params)

    respond_to do |format|
      if @subscription.save
---
INSERT INTO "subscriptions" ("price", "created_at", "updated_at") VALUES (?, ?, ?)  [["price", 5], ["created_at", "2018-04-11 11:08:51.125267"], ["updated_at", "2018-04-11 11:08:51.125267"]]

    def set_subscription
      @subscription = Subscription.find(params[:id])
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]