tp/methods_rails/first_example/app/controllers/user_subscriptions_controller.rb

  def index
    	@user_subscriptions = UserSubscription.all
---
SELECT "user_subscriptions".* FROM "user_subscriptions"

  def create
    @user_subscription = UserSubscription.new(user_subscription_params)

    respond_to do |format|
      if @user_subscription.save
---
INSERT INTO "user_subscriptions" ("user_id", "subscription_id", "type_of", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["subscription_id", 1], ["type_of", "Teacher"], ["created_at", "2018-04-11 11:27:13.256536"], ["updated_at", "2018-04-11 11:27:13.256536"]]

    def set_user_subscription
      @user_subscription = UserSubscription.find(params[:id])
---
SELECT "user_subscriptions".* FROM "user_subscriptions" WHERE "user_subscriptions"."subscription_id" = ?  [["subscription_id", 1]]